src/recent_reading3.zh.org
#+STARTUP: showall

* 分享最近阅读的书藉清单(三)

  #+BEGIN_QUOTE
  一个经常阅读的人在他死之前已经活了上千次了……一个从不阅读的人只活了一次。

  --乔治 R·R 马丁
  #+END_QUOTE

  这些都是在行业中的好书藉或好内容，我想把这些优秀的东西分享出来，并赋上自己的一些主观想法，
  能让更多人知道并从中受益。这里只是做一个引荐，精彩需要你自己亲自拜读从中感受。

** Category Theory for Programmers[fn:1]

   写给程序员的范畴论

   #+BEGIN_QUOTE
   简单并不是先于复杂，而是紧随其后。

   --艾伦·佩利斯
   #+END_QUOTE

   * 我的结论

     这本书有一个配套课程[fn:2]，

** The Practice of Programming[fn:3]

   程序设计实践

   #+BEGIN_QUOTE
   如果人类能从历史中吸取教训，它会给我们什么教训！但是激情和党派蒙蔽了我们的双眼，经验所发出的光是茎上的一盏灯，只照亮我们身后的海浪！

   --塞缪尔·泰勒·柯勒律治《回忆》
   #+END_QUOTE

   * 我的结论

** Introduction to Game Programming (C++)[fn:4]

   游戏编程介绍（C++）

   #+BEGIN_QUOTE
   这就是重点：不是为了卖东西；也不是随潮流；而是因为热爱一些东西；做一些我们创作者喜欢的东西，这是我们在制作游戏时应该有的核心感觉。

   --茂る 宮本, 谈及宝可梦的创造
   #+END_QUOTE

   * 我的结论

     这是免费的游戏编程公开课；

** JavaScript for impatient programmers[fn:5]

   写给不耐烦程序员的 JavaScript

   #+BEGIN_QUOTE
   要是咱们，得罪了请原谅。

   咱们本来是，一片的好意，

   想要显一显。薄薄的伎俩，

   那才是咱们原来的本意。

   --威廉·莎士比亚，仲夏夜之梦
   #+END_QUOTE

   * 我的结论

** Deep JavaScript[fn:6]

   深入JavaScript

   #+BEGIN_QUOTE
   实践并不能成就完美。只有完美的实践才能成就完美。

   --文斯·隆巴迪
   #+END_QUOTE

   * 我的结论

** The Art of PostgreSQL[fn:7]

   PostgreSQL的艺术

   #+BEGIN_QUOTE
   数据占主导地位。 如果您选择了正确的数据结构并将事物组织得井井有条，那么算法几乎总是不言而喻的。数据结构而不是算法才是编程的核心。

   --罗布·派克
   #+END_QUOTE

   * 我的结论

** The Passionate Programmer: Creating a Remarkable Career in Software Development[fn:8]

   我编程，我快乐: 程序员职业规划之道

   #+BEGIN_QUOTE
   在我们的文化中，听从父母的建议是一件神圣的事情。它被视为孩子的职责，并与履行自己的宗教职责一样被视为正确的事情。
   书籍、电影和电视情节都以听取父母的智慧作为一种美德。但对于我们这个IT行业来说，这种美德是错误的。

   --文中摘要
   #+END_QUOTE

   * 我的结论

** Remote: Office Not Required[fn:9]

   远程工作

   #+BEGIN_QUOTE
   未来已经到来——只是还没有平均的发散出去。

   ——威廉·吉布森
   #+END_QUOTE

   * 我的结论

     有时候面对变革并没有那么困难，我们需要做的只是改变自已的观念; 对于工作他并不是你的束缚，相反他是你活着的证明。
     工作不是大家聚在一个办公室群策群力解决问题，而是我们在问题面前每个人发挥自已的专业能力去解决他。首先要生活的
     有意义，你就要有能力在闲暇之于去做一些事情。而我们做事情不一定要在固定的场所，可以是任何能高效发挥你能力的地方，
     这便有了远程工作。你可以在家里，在咖啡厅；或者是正在旅行的酒店里，房车里，野外等。美国从2005年至2011年远程
     工作人数飙升73%达到3百万人，也就是说远程工作已经是一种举手投足间的常态了；或许你已经生活在其中了，或许你早有
     所闻了，又或许你可能刚意识到这个现象；这本书就是关于远程工作的一本书，他告诉你远程工作的好处和解决其中的困难，
     他让你对工作有重新的认识。

** The Clean Coder：A Code of Conduct for Professional Programmers[fn:10]

   代码整洁之道: 程序员的职业素养

   #+BEGIN_QUOTE
   “哦笑吧，老男孩科廷。这是主对我们开的一个很好的玩笑，也或者是命运，或者自然开的，由你喜欢吧。但是无论是谁，无论是什么，
   玩它的人肯定很有幽默感哈！”

   --霍华德,《马德雷山脉的宝藏7》
   #+END_QUOTE

   * 我的结论

** Learn C++[fn:11]

   C++学习

   #+BEGIN_QUOTE
   请记住，程序老兵永远不死——他们只是超出了作用域。

   --Alex
   #+END_QUOTE

   * 我的结论

     三人行则必有我师，网络时代有一技之长都可以成为老师；我只恨自己没有在更早时看到这个资源，以至于让我感慨自己在
     学校花的如此多的时间和金钱简直就是一种浪费。他是由个人编写，发布在网站上的C++初学者学习课程，靠着网页浏览量
     的广告收入来维持网站的运转，他的授课如此优秀，相比现实中的老师是有过之而无不及：他浅显易懂，在我的印象中C++
     是一门抽象的语言，但是他的讲解简短，一章一个知识点，每一个知识点很有趣，总能让我对下一章充满兴趣；循序渐近，
     他的每一章的编排也是互相关联慢慢增加你的知识的，跟现在许多优秀的入门教材一样，特别是在技术行业，你能很快的看
     到自己努力的成果；接地气，没有专业的术语，没有深奥的理论，没有故作深沉，有的只是一个朋友侃侃而谈；
     免费，无门槛，有解答，他是免费的可全网查看的资源，没有设置任何的门槛，他只希望你不要对他的网站广告拦截，
     因为那是维持网站的收入来源，并且他也会解答一些在评论中的问题。或许所谓的网络时代就是只要我们肯努力，
     都能找到最好的资源来指导自已前进的方向，这也是这个行业的优势，我们总是乐于毫无保留的分享自己的知识和成果。

* 写在后面

  1. [[https://tiglapiles.github.io/article/src/recent_reading.html][分享最近阅读的书籍清单(一)]]
  2. [[https://tiglapiles.github.io/article/src/recent_reading2.zh.html][分享最近阅读的书籍清单(二)]]
  3. [[https://tiglapiles.github.io/article/src/recent_reading3.zh.html][本文地址]]
  4. 更多文章欢迎访问我的[[https://github.com/tiglapiles/article][github仓库]]
  5. 捐助我的[[https://itch.io/profile/tiglapiles][游戏]](定期上新)，支持我的创作
  6. 转载请注明出处
  7. [[https://www.v2ex.com/t/805027][社区更新地址]]

* Footnotes

[fn:11] https://www.learncpp.com/

[fn:10] https://book.douban.com/subject/11614538/

[fn:9] https://book.douban.com/subject/21362627/

[fn:8] https://book.douban.com/subject/4923179/

[fn:7] https://theartofpostgresql.com/

[fn:6] https://exploringjs.com/deep-js/toc.html

[fn:5] https://exploringjs.com/impatient-js/toc.html

[fn:4] http://www.cs.mun.ca/~dchurchill/teaching.shtml

[fn:3] http://brendanfong.com/programmingcats.html

[fn:2] http://brendanfong.com/programmingcats.html

[fn:1] https://github.com/hmemcpy/milewski-ctfp-pdf
