src/recent_reading3.zh.md

# Table of Contents

1.  [分享最近阅读的书藉清单(三)](#org3d83c7d)
    1.  [Category Theory for Programmers](#org775857d)
    2.  [The Practice of Programming](#org77bc70e)
    3.  [Introduction to Game Programming (C++)](#org34081dc)
    4.  [JavaScript for impatient programmers](#org917c9b1)
    5.  [Deep JavaScript](#org41cfd33)
    6.  [The Art of PostgreSQL](#org8516e8b)
    7.  [The Passionate Programmer: Creating a Remarkable Career in Software Development](#orgf3888e5)
    8.  [Remote: Office Not Required](#orgdc4e54a)
    9.  [The Clean Coder：A Code of Conduct for Professional Programmers](#org9dbdc1e)
    10. [Learn C++](#org3602866)
2.  [写在后面](#org2107adb)



<a id="org3d83c7d"></a>

# 分享最近阅读的书藉清单(三)

> 一个经常阅读的人在他死之前已经活了上千次了……一个从不阅读的人只活了一次。
> 
> &#x2013;乔治 R·R 马丁

这些都是在行业中的好书藉或好内容，我想把这些优秀的东西分享出来，并赋上自己的一些主观想法，
能让更多人知道并从中受益。这里只是做一个引荐，精彩需要你自己亲自拜读从中感受。


<a id="org775857d"></a>

## Category Theory for Programmers<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>

写给程序员的范畴论

> 简单并不是先于复杂，而是紧随其后。
> 
> &#x2013;艾伦·佩利斯

-   我的结论
    
    这本书有一个配套课程<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>，


<a id="org77bc70e"></a>

## The Practice of Programming<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>

程序设计实践

> 如果人类能从历史中吸取教训，它会给我们什么教训！但是激情和党派蒙蔽了我们的双眼，经验所发出的光是茎上的一盏灯，只照亮我们身后的海浪！
> 
> &#x2013;塞缪尔·泰勒·柯勒律治《回忆》

-   我的结论


<a id="org34081dc"></a>

## Introduction to Game Programming (C++)<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>

游戏编程介绍（C++）

> 这就是重点：不是为了卖东西；也不是随潮流；而是因为热爱一些东西；做一些我们创作者喜欢的东西，这是我们在制作游戏时应该有的核心感觉。
> 
> &#x2013;茂る 宮本, 谈及宝可梦的创造

-   我的结论
    
    这是免费的游戏编程公开课；


<a id="org917c9b1"></a>

## JavaScript for impatient programmers<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>

写给不耐烦程序员的 JavaScript

> 要是咱们，得罪了请原谅。
> 
> 咱们本来是，一片的好意，
> 
> 想要显一显。薄薄的伎俩，
> 
> 那才是咱们原来的本意。
> 
> &#x2013;威廉·莎士比亚，仲夏夜之梦

-   我的结论


<a id="org41cfd33"></a>

## Deep JavaScript<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup>

深入JavaScript

> 实践并不能成就完美。只有完美的实践才能成就完美。
> 
> &#x2013;文斯·隆巴迪

-   我的结论


<a id="org8516e8b"></a>

## The Art of PostgreSQL<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup>

PostgreSQL的艺术

> 数据占主导地位。 如果您选择了正确的数据结构并将事物组织得井井有条，那么算法几乎总是不言而喻的。数据结构而不是算法才是编程的核心。
> 
> &#x2013;罗布·派克

-   我的结论


<a id="orgf3888e5"></a>

## The Passionate Programmer: Creating a Remarkable Career in Software Development<sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup>

我编程，我快乐: 程序员职业规划之道

> 在我们的文化中，听从父母的建议是一件神圣的事情。它被视为孩子的职责，并与履行自己的宗教职责一样被视为正确的事情。
> 书籍、电影和电视情节都以听取父母的智慧作为一种美德。但对于我们这个IT行业来说，这种美德是错误的。
> 
> &#x2013;文中摘要

-   我的结论


<a id="orgdc4e54a"></a>

## Remote: Office Not Required<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup>

远程工作

> 未来已经到来——只是还没有平均的发散出去。
> 
> ——威廉·吉布森

-   我的结论
    
    有时候面对变革并没有那么困难，我们需要做的只是改变自已的观念; 对于工作他并不是你的束缚，相反他是你活着的证明。
    工作不是大家聚在一个办公室群策群力解决问题，而是我们在问题面前每个人发挥自已的专业能力去解决他。首先要生活的
    有意义，你就要有能力在闲暇之于去做一些事情。而我们做事情不一定要在固定的场所，可以是任何能高效发挥你能力的地方，
    这便有了远程工作。你可以在家里，在咖啡厅；或者是正在旅行的酒店里，房车里，野外等。美国从2005年至2011年远程
    工作人数飙升73%达到3百万人，也就是说远程工作已经是一种举手投足间的常态了；或许你已经生活在其中了，或许你早有
    所闻了，又或许你可能刚意识到这个现象；这本书就是关于远程工作的一本书，他告诉你远程工作的好处和解决其中的困难，
    他让你对工作有重新的认识。


<a id="org9dbdc1e"></a>

## The Clean Coder：A Code of Conduct for Professional Programmers<sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup>

代码整洁之道: 程序员的职业素养

> “哦笑吧，老男孩科廷。这是主对我们开的一个很好的玩笑，也或者是命运，或者自然开的，由你喜欢吧。但是无论是谁，无论是什么，
> 玩它的人肯定很有幽默感哈！”
> 
> &#x2013;霍华德,《马德雷山脉的宝藏7》

-   我的结论


<a id="org3602866"></a>

## Learn C++<sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup>

C++学习

> 请记住，程序老兵永远不死——他们只是超出了作用域。
> 
> &#x2013;Alex

-   我的结论
    
    三人行则必有我师，网络时代有一技之长都可以成为老师；我只恨自己没有在更早时看到这个资源，以至于让我感慨自己在
    学校花的如此多的时间和金钱简直就是一种浪费。他是由个人编写，发布在网站上的C++初学者学习课程，靠着网页浏览量
    的广告收入来维持网站的运转，他的授课如此优秀，相比现实中的老师是有过之而无不及：他浅显易懂，在我的印象中C++
    是一门抽象的语言，但是他的讲解简短，一章一个知识点，每一个知识点很有趣，总能让我对下一章充满兴趣；循序渐近，
    他的每一章的编排也是互相关联慢慢增加你的知识的，跟现在许多优秀的入门教材一样，特别是在技术行业，你能很快的看
    到自己努力的成果；接地气，没有专业的术语，没有深奥的理论，没有故作深沉，有的只是一个朋友侃侃而谈；
    免费，无门槛，有解答，他是免费的可全网查看的资源，没有设置任何的门槛，他只希望你不要对他的网站广告拦截，
    因为那是维持网站的收入来源，并且他也会解答一些在评论中的问题。或许所谓的网络时代就是只要我们肯努力，
    都能找到最好的资源来指导自已前进的方向，这也是这个行业的优势，我们总是乐于毫无保留的分享自己的知识和成果。


<a id="org2107adb"></a>

# 写在后面

1.  [分享最近阅读的书籍清单(一)](https://tiglapiles.github.io/article/src/recent_reading.html)
2.  [分享最近阅读的书籍清单(二)](https://tiglapiles.github.io/article/src/recent_reading2.zh.html)
3.  [本文地址](https://tiglapiles.github.io/article/src/recent_reading3.zh.html)
4.  更多文章欢迎访问我的[github仓库](https://github.com/tiglapiles/article)
5.  捐助我的[游戏](https://itch.io/profile/tiglapiles)(定期上新)，支持我的创作
6.  转载请注明出处
7.  [社区更新地址](https://www.v2ex.com/t/805027)


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> <https://github.com/hmemcpy/milewski-ctfp-pdf>

<sup><a id="fn.2" href="#fnr.2">2</a></sup> <http://brendanfong.com/programmingcats.html>

<sup><a id="fn.3" href="#fnr.3">3</a></sup> <http://brendanfong.com/programmingcats.html>

<sup><a id="fn.4" href="#fnr.4">4</a></sup> <http://www.cs.mun.ca/~dchurchill/teaching.shtml>

<sup><a id="fn.5" href="#fnr.5">5</a></sup> <https://exploringjs.com/impatient-js/toc.html>

<sup><a id="fn.6" href="#fnr.6">6</a></sup> <https://exploringjs.com/deep-js/toc.html>

<sup><a id="fn.7" href="#fnr.7">7</a></sup> <https://theartofpostgresql.com/>

<sup><a id="fn.8" href="#fnr.8">8</a></sup> <https://book.douban.com/subject/4923179/>

<sup><a id="fn.9" href="#fnr.9">9</a></sup> <https://book.douban.com/subject/21362627/>

<sup><a id="fn.10" href="#fnr.10">10</a></sup> <https://book.douban.com/subject/11614538/>

<sup><a id="fn.11" href="#fnr.11">11</a></sup> <https://www.learncpp.com/>
